In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [2]:
df = DataFrame({'k1': ['X', 'X', 'Y', 'Y', 'Z'],
               'k2':['alpha', 'beta', 'alpha', 'beta', 'alpha'],
               'dataset1': np.random.randn(5),
               'dataset2': np.random.randn(5)})

df

  k1     k2  dataset1  dataset2
0  X  alpha -0.456230  1.621657
1  X   beta -0.840972 -0.283210
2  Y  alpha -0.824902  0.640649
3  Y   beta -0.311128  0.076819
4  Z  alpha  1.319065  0.242808

In [5]:
group1 = df['dataset1'].groupby(df['k1'])

In [6]:
group1.mean()

k1
X   -0.648601
Y   -0.568015
Z    1.319065
Name: dataset1, dtype: float64

In [7]:
cities = np.array(['NY', 'LA', 'LA', 'NY', 'NY'])

month = np.array(['JAN', 'FEB', 'JAN', 'FEB', 'JAN'])

In [9]:
df['dataset1'].groupby([cities,month]).mean()

LA  FEB   -0.840972
    JAN   -0.824902
NY  FEB   -0.311128
    JAN    0.431417
Name: dataset1, dtype: float64

In [10]:
df.groupby('k1').mean()

    dataset1  dataset2
k1
X  -0.648601  0.669224
Y  -0.568015  0.358734
Z   1.319065  0.242808

In [12]:
df.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -0.456230  1.621657
   beta  -0.840972 -0.283210
Y  alpha -0.824902  0.640649
   beta  -0.311128  0.076819
Z  alpha  1.319065  0.242808

In [14]:
df.groupby('k1').size()

k1
X    2
Y    2
Z    1
dtype: int64

In [17]:
for name,group in df.groupby('k1'):
    print("This is the %s group" %name)
    print(group)
    print('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha -0.456230  1.621657
1  X   beta -0.840972 -0.283210


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha -0.824902  0.640649
3  Y   beta -0.311128  0.076819


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha  1.319065  0.242808

In [19]:
for (k1,k2), group in df.groupby(['k1','k2']):
    print("Key1 = %s, Key2 = %s" %(k1,k2))
    print(group)
    print('\n')

Key1 = X, Key2 = alpha
  k1     k2  dataset1  dataset2
0  X  alpha  -0.45623  1.621657


Key1 = X, Key2 = beta
  k1    k2  dataset1  dataset2
1  X  beta -0.840972  -0.28321


Key1 = Y, Key2 = alpha
  k1     k2  dataset1  dataset2
2  Y  alpha -0.824902  0.640649


Key1 = Y, Key2 = beta
  k1    k2  dataset1  dataset2
3  Y  beta -0.311128  0.076819


Key1 = Z, Key2 = alpha
  k1     k2  dataset1  dataset2
4  Z  alpha  1.319065  0.242808

In [20]:
group_dict = dict(list(df.groupby('k1')))

In [21]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha -0.456230  1.621657
1  X   beta -0.840972 -0.283210

In [23]:
group_dict_axis1 = dict(list(df.groupby(df.dtypes,axis=1)))

In [24]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0 -0.456230  1.621657
 1 -0.840972 -0.283210
 2 -0.824902  0.640649
 3 -0.311128  0.076819
 4  1.319065  0.242808, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [25]:
dataset2_group = df.groupby(['k1','k2'])[['dataset2']]

dataset2_group.mean()

          dataset2
k1 k2
X  alpha  1.621657
   beta  -0.283210
Y  alpha  0.640649
   beta   0.076819
Z  alpha  0.242808